import random
def determine_magic_potion():
    potion_container_list = [
        'Γυάλινο',
        'Πέτρινο',
        'Δερμάτινο',
        'Πήλινο',
        'Τσίγκινο',
        'Κοκάλινο',
        'Κρυστάλλινο',
        'Μπρούτζινο',
        'Χρυσό',
        'Ασημένιο',
        'Ξύλινο',
        'Κέρας'
    ]
    potion_colour_list = [
        'Διαφανές',
        'Λευκό',
        'Μαύρο',
        'Κόκκινο',
        'Γαλάζιο',
        'Πράσινο',
        'Κίτρινο',
        'Μωβ',
        'Καφέ',
        'Ροζ',
        'Γκρίζο',
        'Πορφυρό'
    ]
    potion_other_list = [
        'Υφή νερού',
        'Παχύρευστο',
        'Αναβράζον',
        'Λαδερό',
        'Μεταλλικό',
        'Ατμός',
        'Γλοιώδες',
        'Σχεδόν αέριο',
        'Ιριδίζον',
        'Φωσφορούχο',
        'Ζεστό',
        'Κρύο'
    ]
    potion_odour_list = [
        'Καμία',
        'Όξινη',
        'Γλυκιά',
        'Σάπια',
        'Άρωμα',
        'Αλκοόλ',
        'Καπνός',
        'Γρασίδι',
        'Χημική',
        'Μούχλα',
        'Θειάφι',
        'Σκόρδο'
    ]

    magic_potions_list = [
        'Αντίδοτο',
        'Αντίδοτο',
        'Απόσταγμα Παγωνιάς',
        'Βασιλικό Ύδωρ',
        'Δηλητήριο',
        'Εκρηκτικό Φίλτρο',
        'Ελιξίριο Νεότητας',
        'Ελιξίριο Υγείας',
        'Λάδι Οξύτητας',
        'Λάδι του Χελιού',
        'Υγρό Πυρ',
        'Φίλτρο Αέριας Υπόστασης',
        'Φίλτρο Αλήθειας',
        'Φίλτρο Ανάσας Δράκοντα',
        'Φίλτρο Αορατότητας',
        'Φίλτρο της Αράχνης',
        'Φίλτρο Ατρωσιμότητας',
        'Φίλτρο Ελέγχου',
        'Φίλτρο Ελέγχου',
        'Φίλτρο Ελέγχου',
        'Φίλτρο Ελέγχου',
        'Φίλτρο Ελέγχου',
        'Φίλτρο Ζωτικότητας',
        'Φίλτρο Ηρωισμού',
        'Φίλτρο Ίασης',
        'Φίλτρο Ίασης',
        'Φίλτρο Μεγέθυνσης',
        'Φίλτρο Μεταμόρφωσης',
        'Φίλτρο Οξείας Όρασης',
        'Φίλτρο Όρασης Αοράτων',
        'Φίλτρο Όρασης Αοράτων',
        'Φίλτρο Πτήσης',
        'Φίλτρο Σμίκρυνσης',
        'Φίλτρο Στοιχειακής Αντίστασης',
        'Φίλτρο Στοιχειακής Αντίστασης',
        'Φίλτρο Ταχύτητας',
        'Φίλτρο Τηλεπάθειας',
        'Φίλτρο Υποβρύχιας Αναπνοής',
        'Φίλτρο Υποβρύχιας Αναπνοής'
    ]
    magic_potion = random.choice(magic_potions_list)
    magic_potion_properties = f'{random.choice(potion_container_list)} δοχείο, χρώμα {random.choice(potion_colour_list).lower()}. {random.choice(potion_other_list)}, οσμή/γεύση: {random.choice(potion_odour_list).lower()}'
    print(magic_potion + '. ' + magic_potion_properties)
    return magic_potion