import random


def determine_misc_magic_item():
    misc_magic_items_list = [
        'Αθόρυβες Μπότες',
        'Αντικείμενο ελέγχου στοιχειακών',
        'Γάντια Θηριώδους Δύναμης',
        'Δόντια του Δράκοντα',
        'Εύχαντρο της Εξαίσιας Ανάπαυλας',
        'Ζώνη Γιγαντοδύναμης',
        'Καθρέφτης Εγκλωβισμού',
        'Κέρας της Αφθονίας',
        'Κέρας της Καταστροφής',
        'Κράνος Κατανόησης',
        'Κράνος Προστασίας Μυαλού',
        'Κράνος Τηλεμεταφοράς',
        'Κράνος Τηλεπάθειας',
        'Κρυστάλλινη Σφαίρα',
        'Λαίμαργος Σάκος',
        'Μαγική Λύρα',
        'Μαγικό Αυγό',
        'Μαγικό Διαπασών',
        'Μαγικό Χαλί',
        'Μαγικός Σάκος',
        'Μανδύας Διατοπισμού',
        'Μάσκα του Στοιχειού',
        'Μάτι του Χολσόρνα',
        'Μπότες Αιώρησης',
        'Μπότες Ακαταμάχητου Χορού',
        'Μπότες Άλματος και Διασκελισμού',
        'Μπότες της Ταχύτητας',
        'Μπουκάλι Μαγικού Καπνού',
        'Σκοινί της Περίπλεξης',
        'Τύμπανα του Πανικού',
        'Φακοί Ερυθρόρασης',
        'Φορητή Κρύπτη',
        'Χαμαιλεοντικός Μανδύας'
    ]

    misc_magic_item = ' '.join(random.choices(misc_magic_items_list,
                                              weights=[0.08, 0.03, 0.03, 0.03, 0.03, 0.03, 0.03, 0.03, 0.03, 0.08,
                                                       0.03, 0.03, 0.03, 0.03, 0.03, 0.03, 0.03, 0.03, 0.03, 0.08, 0.03,
                                                       0.03, 0.03, 0.03, 0.03, 0.03, 0.03, 0.03, 0.03, 0.03, 0.03, 0.03,
                                                       0.03]
                                              ))
    print(misc_magic_item)
    return misc_magic_item


determine_misc_magic_item()
